In [2]:
import pandas as pd
import numpy as np

In [3]:
from pandas import Series,DataFrame

# Series

In [3]:
obj=pd.Series([1,4,-2,8])

In [4]:
obj

0    1
1    4
2   -2
3    8
dtype: int64

In [5]:
obj2=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [6]:
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
obj2['c']

3

# Dataframe

In [13]:
data={'name':['Olivia', 'Julia', 'Sasha','Kesha'],
     'year':[1996,1994,1997,1995],
     'pop':[1.5, 1.7, 3.6, 2.4]}

In [14]:
frame=pd.DataFrame(data)

In [15]:
frame

     name  year  pop
0  Olivia  1996  1.5
1   Julia  1994  1.7
2   Sasha  1997  3.6
3   Kesha  1995  2.4

In [16]:
frame.head()

     name  year  pop
0  Olivia  1996  1.5
1   Julia  1994  1.7
2   Sasha  1997  3.6
3   Kesha  1995  2.4

In [17]:
pd.DataFrame(data,columns=['year','name','pop'])

   year    name  pop
0  1996  Olivia  1.5
1  1994   Julia  1.7
2  1997   Sasha  3.6
3  1995   Kesha  2.4

In [20]:
frame2=pd.DataFrame(data, columns=['year','name','pop','debt'],
            index=['one','two','three','four'])

In [21]:
frame2

       year    name  pop debt
one    1996  Olivia  1.5  NaN
two    1994   Julia  1.7  NaN
three  1997   Sasha  3.6  NaN
four   1995   Kesha  2.4  NaN

In [23]:
frame2.loc['two']

year     1994
name    Julia
pop       1.7
debt      NaN
Name: two, dtype: object

In [28]:
frame2.debt=2

In [25]:
frame2

       year    name  pop  debt
one    1996  Olivia  1.5     2
two    1994   Julia  1.7     2
three  1997   Sasha  3.6     2
four   1995   Kesha  2.4     2

In [37]:
val=pd.Series([1.2,-1.5],index=['two','three'])

In [38]:
frame2['debt']=val

In [39]:
frame2

       year    name  pop  debt
one    1996  Olivia  1.5   NaN
two    1994   Julia  1.7   1.2
three  1997   Sasha  3.6  -1.5
four   1995   Kesha  2.4   NaN

In [40]:
frame2['Canadian']=frame2['name']=='Sasha'

In [41]:
frame2

       year    name  pop  debt  Canadian
one    1996  Olivia  1.5   NaN     False
two    1994   Julia  1.7   1.2     False
three  1997   Sasha  3.6  -1.5      True
four   1995   Kesha  2.4   NaN     False

In [42]:
del frame2['Canadian']

In [44]:
frame2

       year    name  pop  debt
one    1996  Olivia  1.5   NaN
two    1994   Julia  1.7   1.2
three  1997   Sasha  3.6  -1.5
four   1995   Kesha  2.4   NaN

In [4]:
obj=pd.Series(range(3),  index=['a','b','c'])

In [5]:
index=obj.index

In [6]:
index

Index(['a', 'b', 'c'], dtype='object')

In [7]:
index[1:]

Index(['b', 'c'], dtype='object')

In [8]:
index[1]='d'

TypeError: Index does not support mutable operations

In [11]:
labels=pd.Index(np.arange(3))

In [12]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [13]:
obj2=pd.Series([1.5,-2.5,0],index=labels)

In [14]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [15]:
obj2.index is labels

True

In [17]:
#panda index can contain duplicate lables

# Essential Functionality- Series or DataFrame

In [20]:
#Reindexing- Means create a new object with data confirmed to new index

In [21]:
obj=pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [22]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [24]:
obj2= obj.reindex(['a','b','c','d','e'])

In [25]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [26]:
obj3=pd.Series(['blue','yelow','purple'],index=[0,2,4])

In [28]:
obj3

0      blue
2     yelow
4    purple
dtype: object

In [29]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2     yelow
3     yelow
4    purple
5    purple
dtype: object

In [30]:
#DataFrame
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],
                   columns=['Ohio','Texas','California'])

In [31]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [33]:
frame2=frame.reindex(['a','b','c','d'])

In [34]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [35]:
states=['Texas','Utah','California']

In [36]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

# Dropping Enteries from an axis

In [7]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [8]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [39]:
obj2=obj.drop(['c'])

In [40]:
obj2

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [41]:
#Dataframe

In [42]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [43]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Indexing, Selection, and Filtering

In [10]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])

In [11]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [12]:
obj['b']

1.0

In [13]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [14]:
obj['b':'c']=5

In [15]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [20]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [21]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [23]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [26]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [28]:
#selection loc and iloc

In [29]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [30]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [31]:
ser = pd.Series(np.arange(3.))

In [34]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [35]:
#Arithmetic and Data Alignment

In [4]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [5]:
s2=pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [6]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [7]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [8]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [9]:
df1=pd.DataFrame(np.arange(9.).reshape(3,3),columns=list('bcd'),index=['Ohio','Texas','Colarado'])

In [10]:
df2=pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [11]:
df1+df2

            b   c     d   e
Colarado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [12]:
#Function Application and Mapping

In [13]:
frame=pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [14]:
frame

               b         d         e
Utah    0.180656 -0.030345 -1.488468
Ohio    2.097738  0.897219 -1.210575
Texas   0.136558 -0.164223  1.676779
Oregon -2.079141 -1.938222 -1.359634

In [15]:
np.abs(frame)

               b         d         e
Utah    0.180656  0.030345  1.488468
Ohio    2.097738  0.897219  1.210575
Texas   0.136558  0.164223  1.676779
Oregon  2.079141  1.938222  1.359634

In [16]:
f= lambda x:x.max()-x.min()

In [17]:
frame.apply(f)

b    4.176879
d    2.835442
e    3.165246
dtype: float64

In [18]:
frame.apply(f,axis='columns')

Utah      1.669124
Ohio      3.308313
Texas     1.841002
Oregon    0.719507
dtype: float64

In [19]:
def f(x): return pd.Series([x.min(),x.max()],index=['min','max'])

In [20]:
frame.apply(f)

            b         d         e
min -2.079141 -1.938222 -1.488468
max  2.097738  0.897219  1.676779

In [21]:
#Sorting And Ranking

In [4]:
obj=pd.Series(range(4),index=['a','b','c','d'])

In [5]:
obj.sort_index()

a    0
b    1
c    2
d    3
dtype: int64

In [6]:
obj.sort_values()

a    0
b    1
c    2
d    3
dtype: int64

In [7]:
frame= pd.DataFrame(np.arange(8).reshape(2,4), index=['a','b'],columns=['d','a','c','b'])

In [9]:
frame

   d  a  c  b
a  0  1  2  3
b  4  5  6  7

In [10]:
frame.sort_index()

   d  a  c  b
a  0  1  2  3
b  4  5  6  7

In [13]:
frame.sort_index(axis=1)

   a  b  c  d
a  1  3  2  0
b  5  7  6  4

In [14]:
frame.sort_index(axis=1,ascending=False)

   d  c  b  a
a  0  2  3  1
b  4  6  7  5